mariopartyrd/marioparty4/src/REL/m401Dll/main_ex.c
#include "game/audio.h"
#include "game/frand.h"
#include "game/hu3d.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/sprite.h"

#include "ext_math.h"

#include "REL/m401Dll.h"

#ifndef __MWERKS__
extern s32 rand8(void);
#endif

struct Bss13EData {
    s16 unk0;
    s16 unk2[3];
};

ANIMDATA *lbl_2_bss_250;
ANIMDATA *lbl_2_bss_24C;
ANIMDATA *lbl_2_bss_248;
ANIMDATA *lbl_2_bss_244;
ANIMDATA *lbl_2_bss_240;
ANIMDATA *lbl_2_bss_23C;
ANIMDATA *lbl_2_bss_238;
ANIMDATA *lbl_2_bss_220[2][3];
struct Bss13EData lbl_2_bss_13E[28];
s16 lbl_2_bss_136[4];
s16 lbl_2_bss_134;
float lbl_2_bss_130;
float lbl_2_bss_12C;
float lbl_2_bss_128;
float lbl_2_bss_124;
s16 lbl_2_bss_120;

void fn_2_10240(Vec *arg0, Vec *arg1)
{
    HU3DCAMERA *camera;
    Mtx lookat;
    Mtx44 proj;
    float coord[4];
    arg0->y = -arg0->y;
    camera = &Hu3DCamera[0];
    MTXLookAt(lookat, &camera->pos, &camera->up, &camera->target);
    MTXMultVec(lookat, arg0, arg0);
    MTXPerspective(proj, camera->fov, camera->aspect, camera->near, camera->far);
    coord[0] = (arg0->x * proj[0][0]) + (arg0->y * proj[0][1]) + (arg0->z * proj[0][2]) + proj[0][3];
    coord[1] = (arg0->x * proj[1][0]) + (arg0->y * proj[1][1]) + (arg0->z * proj[1][2]) + proj[1][3];
    coord[2] = (arg0->x * proj[2][0]) + (arg0->y * proj[2][1]) + (arg0->z * proj[2][2]) + proj[2][3];
    coord[3] = (arg0->x * proj[3][0]) + (arg0->y * proj[3][1]) + (arg0->z * proj[3][2]) + proj[3][3];
    arg1->x = ((coord[0] / coord[3]) * 320.0f) + 320.0f;
    arg1->y = ((coord[1] / coord[3]) * 240.0f) + 240.0f;
    arg1->z = coord[2] / coord[3];
}

void fn_2_1041C(void)
{
    s32 i;
    lbl_2_bss_250 = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x11));
    lbl_2_bss_24C = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x12));
    lbl_2_bss_248 = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x13));
    lbl_2_bss_240 = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x14));
    lbl_2_bss_23C = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x15));
    lbl_2_bss_238 = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x16));
    HuSprAnimLock(lbl_2_bss_250);
    HuSprAnimLock(lbl_2_bss_24C);
    HuSprAnimLock(lbl_2_bss_248);
    HuSprAnimLock(lbl_2_bss_240);
    HuSprAnimLock(lbl_2_bss_23C);
    HuSprAnimLock(lbl_2_bss_238);
    lbl_2_bss_244 = HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M401, 0x26));
    HuSprAnimLock(lbl_2_bss_244);
    lbl_2_bss_220[0][0] = lbl_2_bss_250;
    lbl_2_bss_220[0][1] = lbl_2_bss_24C;
    lbl_2_bss_220[0][2] = lbl_2_bss_248;
    lbl_2_bss_220[1][0] = lbl_2_bss_240;
    lbl_2_bss_220[1][1] = lbl_2_bss_23C;
    lbl_2_bss_220[1][2] = lbl_2_bss_238;
    for (i = 0; i < 4; i++) {
        lbl_2_bss_136[i] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M401, 0x17));
        Hu3DModelAttrSet(lbl_2_bss_136[i], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(lbl_2_bss_136[i], HU3D_MOTATTR_LOOP);
        Hu3DModelScaleSet(lbl_2_bss_136[i], 1.5f, 1.5f, 1.0f);
        Hu3DModelLayerSet(lbl_2_bss_136[i], 2);
    }
}

void fn_2_10710(void)
{
    HuSprAnimKill(lbl_2_bss_250);
    HuSprAnimKill(lbl_2_bss_24C);
    HuSprAnimKill(lbl_2_bss_248);
    HuSprAnimKill(lbl_2_bss_240);
    HuSprAnimKill(lbl_2_bss_23C);
    HuSprAnimKill(lbl_2_bss_238);
    HuSprAnimKill(lbl_2_bss_244);
}

void fn_2_1079C(void)
{
    s32 i;
    for (i = 0; i < 28; i++) {
        lbl_2_bss_13E[i].unk0 = 0;
        lbl_2_bss_13E[i].unk2[0] = Hu3DParticleCreate(lbl_2_bss_250, 80);
        lbl_2_bss_13E[i].unk2[1] = Hu3DParticleCreate(lbl_2_bss_24C, 80);
        lbl_2_bss_13E[i].unk2[2] = Hu3DParticleCreate(lbl_2_bss_248, 80);
        Hu3DModelAttrSet(lbl_2_bss_13E[i].unk2[0], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(lbl_2_bss_13E[i].unk2[1], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(lbl_2_bss_13E[i].unk2[2], HU3D_ATTR_DISPOFF);
    }
    lbl_2_bss_134 = 0;
}

s16 fn_2_108C8(void)
{
    s32 i;
    s32 j;
    for (i = 0; i < 28; i++) {
        if (!lbl_2_bss_13E[i].unk0) {
            for (j = 0; j < 3; j++) {
                Hu3DModelAttrReset(lbl_2_bss_13E[i].unk2[j], HU3D_ATTR_DISPOFF);
            }
            lbl_2_bss_13E[i].unk0 = 1;
            return i;
        }
    }
    return -1;
}

void fn_2_10980(s16 arg0)
{
    s32 i;
    lbl_2_bss_13E[arg0].unk0 = 0;
    for (i = 0; i < 3; i++) {
        Hu3DModelAttrSet(lbl_2_bss_13E[arg0].unk2[i], HU3D_ATTR_DISPOFF);
    }
}

s16 fn_2_10A08(void)
{
    s16 temp_r31 = lbl_2_bss_136[lbl_2_bss_134];
    lbl_2_bss_134 = (lbl_2_bss_134 + 1) & 0x3;
    Hu3DModelTPLvlSet(temp_r31, 1.0f);
    return temp_r31;
}

void fn_2_113AC(OMOBJ *object);
void fn_2_11A68(OMOBJ *object);
void fn_2_11B78(OMOBJ *object);
void fn_2_11C30(OMOBJ *object);
void fn_2_11D40(OMOBJ *object);
void fn_2_11E44(OMOBJ *object);
void fn_2_11EFC(OMOBJ *object);

void fn_2_11FB4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
void fn_2_126C8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
void fn_2_126F4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
void fn_2_12B30(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
void fn_2_1301C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
void fn_2_1350C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
void fn_2_13B7C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

OMOBJ *fn_2_10A88(Vec *arg0, s16 arg1)
{
    OMOBJ *temp_r31;
    s32 temp_r30;
    HU3DPARTICLE *temp_r28;
    UnkWork10A88 *temp_r27;
    s16 temp_r24 = fn_2_108C8();
    if (temp_r24 < 0) {
        return NULL;
    }
    {
        s16 temp_r22 = -1;
        if (arg1 == 0) {
            temp_r22 = 1;
        }
        temp_r31 = omAddObjEx(HuPrcCurrentGet(), 0x514, 3, 0, temp_r22, NULL);
    }

    temp_r31->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(UnkWork10A88), MEMORY_DEFAULT_NUM);
    temp_r27 = temp_r31->data;
    temp_r27->unk0 = *arg0;
    for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
        temp_r31->mdlId[temp_r30] = lbl_2_bss_13E[temp_r24].unk2[temp_r30];
        temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
        Hu3DParticleCntSet(temp_r31->mdlId[temp_r30], 0);
        Hu3DParticleAnimModeSet(temp_r31->mdlId[temp_r30], 0);
        Hu3DModelLayerSet(temp_r31->mdlId[temp_r30], 1);
        if (arg1 == 1) {
            temp_r31->mode = fn_2_10A08();
            Hu3DModelAttrReset(temp_r31->mode, HU3D_ATTR_DISPOFF);
            temp_r28->anim = lbl_2_bss_220[1][temp_r30];
            temp_r27->unk1C = 1.0f;
            temp_r31->work[3] = 45;
            Hu3DModelTPLvlSet(temp_r31->mode, temp_r27->unk1C);
        }
        else {
            temp_r28->anim = lbl_2_bss_220[0][temp_r30];
        }
    }
    temp_r27->unk10 = 3;
    temp_r27->unk12 = temp_r24;
    temp_r27->unk18 = arg1;
    switch (arg1) {
        case 1:
            Hu3DModelPosSet(temp_r31->mode, arg0->x, arg0->y, lbl_2_bss_60.z + arg0->z);

        case 0:
            temp_r31->trans.x = arg0->x;
            temp_r31->trans.y = arg0->y;
            temp_r31->trans.z = lbl_2_bss_60.z + arg0->z;
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_11FB4);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], temp_r31->trans.x, temp_r31->trans.y, temp_r31->trans.z);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 0);
                temp_r28->dataCnt = (temp_r30 * 4.5f) / 3.0f;
                temp_r28->emitCnt = 0;
                temp_r28->work = temp_r31;
            }
            temp_r27->unk14 = 0;
            temp_r31->objFunc = fn_2_113AC;
            break;

