mariopartyrd/marioparty4/src/REL/m401Dll/main_ex.c
        case 2:
            fn_2_A8A4(temp_r31, arg0->x, arg0->y, arg0->z);
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_126C8);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], temp_r31->trans.x, temp_r31->trans.y, temp_r31->trans.z);
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 0);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                temp_r28->dataCnt = (temp_r30 * 2) + (frand() & 0x7);
                temp_r28->work = temp_r31;
            }
            temp_r31->objFunc = fn_2_11A68;
            break;

        case 3:
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_126F4);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], arg0->x, arg0->y, arg0->z);
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 0);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                temp_r28->dataCnt = (temp_r30 * 2) + (frand() & 0x7);
                temp_r28->work = temp_r31;
            }
            temp_r31->objFunc = fn_2_11B78;
            break;

        case 4:
            fn_2_A8A4(temp_r31, arg0->x, arg0->y, arg0->z);
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_12B30);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], temp_r31->trans.x, temp_r31->trans.y, temp_r31->trans.z);
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 0);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                temp_r28->dataCnt = (temp_r30 * 2) + (frand() & 0x7);
                temp_r28->work = temp_r31;
            }
            temp_r31->objFunc = fn_2_11C30;
            break;

        case 5:
            fn_2_A8A4(temp_r31, arg0->x, arg0->y, arg0->z);
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_1301C);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], temp_r31->trans.x, temp_r31->trans.y, temp_r31->trans.z);
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 1);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                temp_r28->dataCnt = (temp_r30 * 2) + (frand() & 0x7);
                temp_r28->work = temp_r31;
            }
            temp_r31->objFunc = fn_2_11D40;
            break;

        case 6:
            omSetTra(temp_r31, arg0->x, arg0->y, arg0->z);
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_1350C);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], temp_r31->trans.x, temp_r31->trans.y, temp_r31->trans.z);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 1);
            }
            temp_r31->objFunc = fn_2_11E44;
            break;

        case 7:
            omSetTra(temp_r31, arg0->x, arg0->y, arg0->z);
            for (temp_r30 = 0; temp_r30 < 3; temp_r30++) {
                Hu3DParticleHookSet(temp_r31->mdlId[temp_r30], fn_2_13B7C);
                Hu3DParticleColSet(temp_r31->mdlId[temp_r30], 255, 255, 255);
                Hu3DModelPosSet(temp_r31->mdlId[temp_r30], temp_r31->trans.x, temp_r31->trans.y, temp_r31->trans.z);
                temp_r28 = Hu3DData[temp_r31->mdlId[temp_r30]].hookData;
                Hu3DParticleBlendModeSet(temp_r31->mdlId[temp_r30], 1);
            }
            temp_r31->objFunc = fn_2_11EFC;
            break;

        default:
            break;
    }
    return temp_r31;
}

void fn_2_118B0(OMOBJ *object);
void fn_2_123F8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

void fn_2_113AC(OMOBJ *object)
{
    UnkWork10A88 *temp_r30;
    s32 temp_r29;
    M401WorkPlayer *temp_r28;
    OMOBJ *temp_r27;
    HU3DPARTICLE *temp_r25;
    s16 temp_r24;
    temp_r30 = object->data;
    temp_r30->unk0.z += (lbl_2_bss_50 * 0.5f);
    object->trans.x = temp_r30->unk0.x;
    object->trans.y = temp_r30->unk0.y;
    object->trans.z = lbl_2_bss_60.z + temp_r30->unk0.z;
    if (object->mode != 0) {
        Hu3DModelPosSet(object->mode, object->trans.x, object->trans.y, object->trans.z);
    }
    for (temp_r29 = 1; temp_r29 < 3; temp_r29++) {
        Hu3DModelRotSet(object->mdlId[temp_r29], object->rot.x, object->rot.y, object->rot.z);
        Hu3DModelPosSet(object->mdlId[temp_r29], object->trans.x, object->trans.y, object->trans.z);
    }
    for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
        float dist;
        temp_r27 = lbl_2_bss_118[temp_r29];
        temp_r28 = temp_r27->data;
        if (temp_r28->unk78 != 0) {
            continue;
        }
        dist = VECDistanceXYZ(&object->trans, &temp_r27->trans);
        if (dist < 108.00001f) {
            Hu3DMotionShiftSet(lbl_2_bss_118[temp_r29]->mdlId[0], lbl_2_bss_118[temp_r29]->mtnId[6], 0, 10, HU3D_MOTATTR_NONE);
            HuAudFXPlay(1288);
            if (temp_r30->unk18 == 0) {
                HuAudFXPlay(9);
                temp_r28->unk72++;
                omVibrate(temp_r28->unk4, 12, 6, 6);
            }
            else {
                HuAudFXPlay(1292);
                temp_r28->unk74 = 3;
                temp_r28->unk72 += 3;
                fn_2_169C(temp_r28->unk4);
                omVibrate(temp_r28->unk4, 12, 4, 2);
            }
            temp_r28->unk84 = 50;
            for (temp_r29 = 0; temp_r29 < 3; temp_r29++) {
                temp_r25 = Hu3DData[object->mdlId[temp_r29]].hookData;
                temp_r25->emitCnt = 0;
                Hu3DParticleHookSet(object->mdlId[temp_r29], fn_2_123F8);
            }
            object->objFunc = fn_2_118B0;
            break;
        }
    }
    if (temp_r30->unk0.z > 850.0f) {
        temp_r30->unk14 = 1;
    }
    if (object->mode) {
        if (object->work[3] != 0) {
            object->work[3]--;
        }
        else {
            temp_r30->unk1C -= 0.033333335f;
            if (temp_r30->unk1C < 0) {
                temp_r30->unk1C = 0;
            }
            Hu3DModelTPLvlSet(object->mode, temp_r30->unk1C);
        }
    }
    if (temp_r30->unk10 == 0) {
        if (object->mode) {
            Hu3DModelAttrSet(object->mode, HU3D_ATTR_DISPOFF);
        }
        fn_2_10980(temp_r30->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_118B0(OMOBJ *object)
{
    UnkWork10A88 *temp_r30;
    s32 temp_r29;

