mariopartyrd/marioparty4/src/REL/m401Dll/main_ex.c
    temp_r30 = object->data;
    temp_r30->unk0.z += (lbl_2_bss_50 * 0.5f);
    object->trans.x = temp_r30->unk0.x;
    object->trans.y = temp_r30->unk0.y;
    object->trans.z = lbl_2_bss_60.z + temp_r30->unk0.z;
    for (temp_r29 = 1; temp_r29 < 3; temp_r29++) {
        Hu3DModelPosSet(object->mdlId[temp_r29], object->trans.x, object->trans.y, object->trans.z);
    }
    if (object->mode != 0) {
        Hu3DModelPosSet(object->mode, object->trans.x, object->trans.y, object->trans.z);
        temp_r30->unk1C -= 0.033333335f;
        if (temp_r30->unk1C < 0) {
            temp_r30->unk1C = 0;
        }
        Hu3DModelTPLvlSet(object->mode, temp_r30->unk1C);
    }

    if (temp_r30->unk10 == 0) {
        if (object->mode) {
            Hu3DModelAttrSet(object->mode, HU3D_ATTR_DISPOFF);
        }
        fn_2_10980(temp_r30->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11A68(OMOBJ *object)
{
    s32 temp_r30;
    UnkWork10A88 *temp_r29;
    UnkWork10A88 *sp8;
    temp_r29 = object->data;
    sp8 = temp_r29->unkC->data;
    omSetTra(object, 0, 0, 0);
    for (temp_r30 = 1; temp_r30 < 3; temp_r30++) {
        Hu3DModelPosSet(object->mdlId[temp_r30], object->trans.x, object->trans.y, object->trans.z);
    }
    if (object->work[0] == 1) {
        fn_2_10980(temp_r29->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11B78(OMOBJ *object)
{
    UnkWork10A88 *temp_r29;
    temp_r29 = object->data;
    if (object->work[0] == 1) {
        fn_2_10980(temp_r29->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11C30(OMOBJ *object)
{
    s32 temp_r30;
    UnkWork10A88 *temp_r29;
    UnkWork10A88 *sp8;
    temp_r29 = object->data;
    sp8 = temp_r29->unkC->data;
    omSetTra(object, 0, 0, 0);
    for (temp_r30 = 1; temp_r30 < 3; temp_r30++) {
        Hu3DModelPosSet(object->mdlId[temp_r30], object->trans.x, object->trans.y, object->trans.z);
    }
    if (object->work[1] == 1) {
        fn_2_10980(temp_r29->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11D40(OMOBJ *object)
{
    s32 temp_r30;
    UnkWork10A88 *temp_r29;
    UnkWork10A88 *sp8;
    temp_r29 = object->data;
    sp8 = temp_r29->unkC->data;
    omSetTra(object, temp_r29->unkC->trans.x, temp_r29->unkC->trans.y, temp_r29->unkC->trans.z);
    for (temp_r30 = 1; temp_r30 < 3; temp_r30++) {
        Hu3DModelPosSet(object->mdlId[temp_r30], object->trans.x, object->trans.y, object->trans.z);
    }
    if (object->work[1] == 1) {
        fn_2_10980(temp_r29->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11E44(OMOBJ *object)
{
    UnkWork10A88 *temp_r29;
    temp_r29 = object->data;
    if (object->work[0] == 1) {
        fn_2_10980(temp_r29->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11EFC(OMOBJ *object)
{
    UnkWork10A88 *temp_r29;
    temp_r29 = object->data;
    if (object->work[0] == 1) {
        fn_2_10980(temp_r29->unk12);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_11FB4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    UnkWork10A88 *temp_r28;
    s32 temp_r27;
    temp_r28 = ((OMOBJ *)(particle->work))->data;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        temp_f29 = 360.0f / (particle->maxCnt / 2);
        temp_f31 = particle->dataCnt;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt / 2; temp_r29++, temp_r31++) {
            temp_f30 = (0.1f * (rand8() % 50)) + 50;
            temp_r31->scale = (0.1f * (rand8() % 41)) + 8.0f;
            temp_r31->vel.x = temp_f31;
            temp_r31->vel.y = temp_f30;
            temp_r31->vel.z = 0;
            temp_r31->accel.x = (10.0f / 255.0f) * ((u8)frand());
            temp_r31->color.a = 180;
            temp_f31 += temp_f29;
            temp_r31->pos.z = 0;
        }
        for (temp_r29 = 0; temp_r29 < particle->maxCnt / 2; temp_r29++, temp_r31++) {
            temp_r31->scale = 0;
            temp_r31->color.a = 0;
        }
    }
    temp_r31 = particle->data;
    temp_r27 = 0;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt / 2; temp_r29++, temp_r31++) {
        if (temp_r31->color.a != 0) {
            temp_r27++;
            temp_f30 = (6.0 * sind(temp_r31->vel.z)) + temp_r31->vel.y;
            temp_r31->pos.x = temp_f30 * cosd(temp_r31->vel.x);
            temp_r31->pos.y = temp_f30 * sind(temp_r31->vel.x);
            temp_r31->vel.z += temp_r31->accel.x;
            if (temp_r31->vel.z >= 360.0f) {
                temp_r31->vel.z -= 360.0f;
            }
            temp_f31 = temp_r31->color.a;
            if (temp_r28->unk14) {
                temp_f31 -= 3.0f;
                if (temp_f31 < 0.0f) {
                    temp_f31 = 0.0f;
                }
            }
            temp_r31->color.a = temp_f31;
        }
    }
    if (!temp_r27) {
        temp_r28->unk10--;
    }
}

void fn_2_123F8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    s32 temp_r28;
    UnkWork10A88 *temp_r27;
    if (!particle->emitCnt) {
        particle->emitCnt = 1;
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt / 2; temp_r29++, temp_r31++) {
            temp_r31->vel.x = temp_r31->pos.x;
            temp_r31->accel.x = 0;
            temp_r31->accel.y = 5.0f + ((35.0f / 255.0f) * ((u8)frand()));
            temp_r31->accel.z = 8.0f + ((8.0f / 255.0f) * ((u8)frand()));
            temp_r31->colorIdx = 3.0f + ((5.0f / 255.0f) * ((u8)frand()));
        }
    }
    temp_r31 = particle->data;
    temp_r28 = 0;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt / 2; temp_r29++, temp_r31++) {
        if (temp_r31->color.a != 0) {
            temp_r28++;
            temp_r31->pos.x = temp_r31->vel.x + (temp_r31->accel.z * sind(temp_r31->accel.x));
            temp_r31->accel.x += temp_r31->accel.y;
            if (temp_r31->accel.x >= 360.0f) {
                temp_r31->accel.x -= 360.0f;
            }
            temp_r31->pos.y += temp_r31->colorIdx;
            temp_f31 = temp_r31->color.a;
            temp_f31 -= 3.0f;
            if (temp_f31 < 0.0f) {
                temp_f31 = 0.0f;
            }
            temp_r31->color.a = temp_f31;
        }
    }
    if (temp_r28 == 0) {
        UnkWork10A88 *temp_r27 = ((OMOBJ *)(particle->work))->data;
        temp_r27->unk10--;
    }
}

// Here exclusively to match fn_2_126C8
static inline void DummyInline(s32 arg0)
{
    s32 temp1, temp2, temp3, temp4, temp5;
    if (arg0 != 0) {
        temp1 = 1;
        temp2 = temp1 * 2;
        temp3 = temp2 * 3;
        temp4 = temp3 * 4;
        temp5 = temp4 * 5;
        temp5 = temp5 / 2;
    }
}

void fn_2_126C8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    DummyInline(0);
}

void fn_2_126F4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    s32 temp_r28;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->color.a = 0;
            temp_r31->scale = 0;
        }
        particle->dataCnt = 0;
    }
    if (particle->dataCnt == 0) {
        for (temp_r29 = 0; temp_r29 < 2; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->color.a == 0) {
                    break;
                }
            }
            if (temp_r28 == particle->maxCnt) {
                continue;
            }
            temp_r31->vel.x = -50.0f + (0.3921569f * ((u8)frand()));
            temp_r31->vel.y = 0.058823533f * ((u8)frand());
            temp_r31->accel.x = (90.0f / 255.0f) * ((u8)frand());
            temp_r31->accel.y = 5.0f + (0.098039225f * ((u8)frand()));
            temp_r31->accel.z = (float)(frand() % 10) + 8.0f;
            temp_r31->pos.z = -5.0f + ((11.0f / 255.0f) * ((u8)frand()));
            temp_r31->pos.y = (float)(frand() % 31) + -5.0f;
            temp_r31->scale = temp_r31->vel.y + 35.0f;
            temp_r31->color.a = 210;
            temp_r31->vel.y = (0.2 * temp_r31->vel.y) + 5.0;
            particle->dataCnt = (frand() % 10) + 10;
        }
    }
    else {
        particle->dataCnt--;
    }
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->color.a == 0) {
            continue;
        }
        temp_r31->pos.x = (temp_r31->accel.z * sind(temp_r31->accel.x)) + temp_r31->vel.x;
        temp_r31->accel.x += temp_r31->accel.y;
        if (temp_r31->accel.x >= 360.0f) {
            temp_r31->accel.x -= 360.0f;
        }
        temp_r31->pos.y += temp_r31->vel.y;
        temp_r31->color.a--;
    }
}

void fn_2_12B30(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    M401WorkPlayer *temp_r28;
    OMOBJ *temp_r27;
    s32 temp_r26;
    s32 temp_r25;
    UnkWork10A88 *temp_r24;
    temp_r27 = particle->work;
    temp_r24 = ((OMOBJ *)(particle->work))->data;
    temp_r28 = temp_r24->unkC->data;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->color.a = 0;
            temp_r31->scale = 0;
            temp_r31->speedDecay = 0;
        }
        particle->dataCnt = 0;
    }
    if (particle->dataCnt == 0 && temp_r27->work[0] == 0) {
        for (temp_r29 = 0; temp_r29 < 10; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r26 = 0; temp_r26 < particle->maxCnt; temp_r26++, temp_r31++) {
                if (temp_r31->speedDecay == 0) {
                    break;
                }
            }
            if (temp_r26 == particle->maxCnt) {
                continue;
            }
            temp_r31->vel.x = (((40.0f / 255.0f) * ((u8)frand())) + (temp_r28->unk18.x - 20.0f));
            temp_r31->vel.y = (frand() % 5) + 3;
            temp_r31->accel.x = ((90.0f / 255.0f) * ((u8)frand()));
            temp_r31->accel.y = 5.0f + ((45.0f / 255.0f) * ((u8)frand()));
            temp_r31->accel.z = 2.0f + (0.011764707f * ((u8)frand()));
            temp_r31->color.a = 180;
            temp_r31->pos.z = ((0.121568635f * ((u8)frand())) + (temp_r28->unk18.z + 70.0f));
            temp_r31->pos.y = ((0.20000002f * ((u8)frand())) + (temp_r28->unk18.y - 25.0f));
            particle->dataCnt = (frand() % 6) + 5;
            temp_r31->speedDecay = 1;
            temp_r31->scale = 11;
        }
    }
    else {
        particle->dataCnt--;
    }
    temp_r31 = particle->data;
    temp_r25 = 0;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->color.a != 0) {
            float temp_f31;
            temp_r31->pos.x = (temp_r31->accel.z * sind(temp_r31->accel.x)) + temp_r31->vel.x;
            temp_r31->accel.x += temp_r31->accel.y;
            if (temp_r31->accel.x >= 360.0f) {
                temp_r31->accel.x -= 360.0f;
            }
            temp_r31->pos.y += 3.0f;
            temp_f31 = temp_r31->color.a;
            temp_f31 -= temp_r31->vel.y;
            if (temp_f31 < 0.0f) {
                temp_f31 = 0.0f;
                temp_r31->speedDecay = 0;
            }

            temp_r31->color.a = temp_f31;
            temp_r25++;
        }
    }
    if (temp_r25 == 0 && temp_r27->work[0] == 1) {
        temp_r27->work[1] = 1;
    }
}

void fn_2_1301C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    M401WorkPlayer *temp_r28;
    OMOBJ *temp_r27;
    s32 temp_r26;
    s32 temp_r25;
    UnkWork10A88 *temp_r24;
    temp_r27 = particle->work;
    temp_r24 = (temp_r27)->data;
    temp_r28 = temp_r24->unkC->data;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->color.a = 0;
            temp_r31->scale = 0;
            temp_r31->speedDecay = 0;
        }
        particle->dataCnt = 0;
    }
    if (particle->dataCnt == 0 && temp_r27->work[0] == 0) {
        for (temp_r29 = 0; temp_r29 < 10; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r26 = 0; temp_r26 < particle->maxCnt; temp_r26++, temp_r31++) {
                if (temp_r31->speedDecay == 0) {
                    break;
                }
            }
            if (temp_r26 == particle->maxCnt) {
                continue;
            }
            temp_r31->vel.x = (((80.0f / 255.0f) * ((u8)frand())) + (-40.0f));
            temp_r31->vel.y = (frand() % 10) + 7;
            temp_r31->accel.x = ((90.0f / 255.0f) * ((u8)frand()));
            temp_r31->accel.y = 5.0f + ((45.0f / 255.0f) * ((u8)frand()));
            temp_r31->accel.z = 2.0f + (frand() % 3);
            temp_r31->color.a = 180;
            temp_r31->pos.z = ((0.121568635f * ((u8)frand())) + (85.0f));
            temp_r31->pos.y = ((0.2392157f * ((u8)frand())) + (-30.0f));
            particle->dataCnt = (frand() % 3) + 3;
            temp_r31->speedDecay = 1;
            temp_r31->scale = 11;
        }
    }
    else {
        particle->dataCnt--;
    }
    temp_r31 = particle->data;
    temp_r25 = 0;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->color.a != 0) {
            float temp_f31;
            temp_r31->pos.x = (temp_r31->accel.z * sind(temp_r31->accel.x)) + temp_r31->vel.x;
            temp_r31->accel.x += temp_r31->accel.y;
            if (temp_r31->accel.x >= 360.0f) {
                temp_r31->accel.x -= 360.0f;
            }
            temp_r31->pos.y += 3.0f;
            temp_r31->pos.z -= 1.0f;
            temp_f31 = temp_r31->color.a;
            temp_f31 -= temp_r31->vel.y;
            if (temp_f31 < 0.0f) {
                temp_f31 = 0.0f;
                temp_r31->speedDecay = 0;
            }

            temp_r31->color.a = temp_f31;
            temp_r25++;
        }
    }
    if (temp_r25 == 0 && temp_r27->work[0] == 1) {
        temp_r27->work[1] = 1;
    }
}

void fn_2_1350C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    s32 temp_r28;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->scale = 0;
        }
        particle->work = (void *)1;
        particle->emitCnt = 0;
        particle->dataCnt = 0;
    }
    if (particle->dataCnt == 0) {
        for (temp_r29 = 0; temp_r29 < 16; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->scale == 0) {
                    break;
                }
            }
            if (temp_r28 == particle->maxCnt) {
                continue;
            }
            temp_f30 = (360.0f / 255.0f) * ((u8)frand());
            temp_r31->speedDecay = 45 * sind(temp_f30);
            temp_r31->scaleBase = 45 * cosd(temp_f30);
            temp_r31->colorIdx = 0;
            temp_f28 = 0.098039225f * ((u8)frand()) + 50.0f;
            temp_f29 = (2.0f / 255.0f) * ((u8)frand()) + 2.5f;
            temp_r31->vel.x = temp_f29 * sind(temp_f30) * cosd(temp_f28);
            temp_r31->vel.y = 0.8f * (temp_f29 * sind(temp_f28));
            temp_r31->vel.z = temp_f29 * cosd(temp_f30) * cosd(temp_f28);
            temp_r31->accel.x = 1;
            temp_r31->accel.y = 255;
            temp_r31->scale = (4.0f / 255.0f) * ((u8)frand()) + 3.0f;
            temp_r31->color.r = (155.0f / 255.0f) * ((u8)frand()) + 100.0f;
            temp_r31->color.g = 0.21568629f * ((u8)frand()) + 200.0f;
            temp_r31->color.b = 255;
            temp_r31->color.a = temp_r31->accel.y;
        }
        particle->dataCnt = 0.058823533f * ((u8)frand()) + 30.0f;
    }
    else {
        particle->dataCnt--;
    }
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->scale != 0) {
            temp_f31 = temp_r31->accel.x;
            temp_r31->pos.x = (temp_r31->vel.x * temp_f31) + temp_r31->speedDecay;
            temp_r31->pos.z = (temp_r31->vel.z * temp_f31) + temp_r31->scaleBase;
            temp_r31->pos.y = ((temp_r31->vel.y * temp_f31) + temp_r31->colorIdx) - (0.2 * temp_f31 * temp_f31);
            temp_r31->accel.y -= 3.5f;
            temp_r31->color.a = temp_r31->accel.y;
            if (temp_r31->scale < 0 || temp_r31->accel.y < 10.0f || temp_r31->pos.y <= 0.0f) {
                temp_r31->scale = 0;
                particle->emitCnt++;
            }

            temp_r31->accel.x += 0.7f;
        }
    }
}

void fn_2_13B7C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    s32 temp_r28;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->scale = 0;
        }
        particle->work = (void *)1;
        particle->emitCnt = 0;
        particle->dataCnt = 0;
    }
    if (particle->work) {
        for (temp_r29 = 0; temp_r29 < 20; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->scale == 0) {
                    break;
                }
            }
            if (temp_r28 != particle->maxCnt) {
                temp_f30 = (360.0f / 255.0f) * ((u8)frand());
                temp_r31->speedDecay = 40 * sind(temp_f30);
                temp_r31->scaleBase = 40 * cosd(temp_f30);
                temp_r31->colorIdx = 0;
                temp_f28 = (20.0f / 255.0f) * ((u8)frand()) + 70.0f;
                temp_f29 = (4.0f / 255.0f) * ((u8)frand()) + 5.0f;
                temp_r31->vel.x = temp_f29 * sind(temp_f30) * cosd(temp_f28);
                temp_r31->vel.y = temp_f29 * sind(temp_f28);
                temp_r31->vel.z = temp_f29 * cosd(temp_f30) * cosd(temp_f28);
                temp_r31->accel.x = 1;
                temp_r31->accel.y = 255;
                temp_r31->scale = (4.0f / 255.0f) * ((u8)frand()) + 5.0f;
                temp_r31->color.r = (155.0f / 255.0f) * ((u8)frand()) + 100.0f;
                temp_r31->color.g = 0.21568629f * ((u8)frand()) + 200.0f;
                temp_r31->color.b = 255;
                temp_r31->color.a = temp_r31->accel.y;
            }
            else {
                particle->work = NULL;
                break;
            }
        }
    }
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->scale != 0) {
            temp_f31 = temp_r31->accel.x;
            temp_r31->pos.x = (temp_r31->vel.x * temp_f31) + temp_r31->speedDecay;
            temp_r31->pos.z = (temp_r31->vel.z * temp_f31) + temp_r31->scaleBase;
            temp_r31->pos.y = ((temp_r31->vel.y * temp_f31) + temp_r31->colorIdx) - (0.2 * temp_f31 * temp_f31);
            temp_r31->accel.y -= 3.5f;
            temp_r31->color.a = temp_r31->accel.y;
            if (temp_r31->scale < 0 || temp_r31->accel.y < 10.0f || temp_r31->pos.y <= 0.0f) {
                temp_r31->scale = 0;
                particle->emitCnt++;
            }
            temp_r31->accel.x += 1.0f;
        }
    }
    if (particle->emitCnt >= particle->maxCnt && particle->work == NULL) {
        particle->dataCnt = 1;
    }
}

