mariopartyrd/marioparty4/src/REL/m401Dll/main_ex.c
void fn_2_142D0(OMOBJ *object);
void fn_2_142D4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

OMOBJ *fn_2_141B0(void)
{
    OMOBJ *object = omAddObjEx(HuPrcCurrentGet(), 1300, 5, 0, -1, fn_2_142D0);
    HU3DPARTICLE *particle;
    omSetStatBit(object, 0x100);
    object->mdlId[0] = Hu3DParticleCreate(lbl_2_bss_244, 200);
    Hu3DParticleHookSet(object->mdlId[0], fn_2_142D4);
    Hu3DParticleColSet(object->mdlId[0], 255, 255, 255);
    Hu3DModelPosSet(object->mdlId[0], 0, 0, 0);
    Hu3DParticleAnimModeSet(object->mdlId[0], 0);
    Hu3DModelLayerSet(object->mdlId[0], 1);
    Hu3DParticleBlendModeSet(object->mdlId[0], 1);
    particle = Hu3DData[object->mdlId[0]].hookData;
    return object;
}

void fn_2_142D0(OMOBJ *object) { }

void fn_2_142D4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    s32 temp_r28;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->scale = 0;
            temp_r31->pos.y = 950;
        }
    }
    if (particle->dataCnt == 0) {
        for (temp_r29 = 0; temp_r29 < 30; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->scale == 0) {
                    break;
                }
            }
            if (temp_r28 == particle->maxCnt) {
                continue;
            }
            temp_r31->scale = 1;
            temp_r31->color.a = 150;
            temp_r31->pos.x = ((11.764707f * ((u8)frand())) + (-1500.0f));
            temp_r31->pos.z = ((6.666667f * ((u8)frand())) + (-2000.0f));
            temp_r31->vel.x = 0;
            temp_r31->vel.y = (((5.0f / 255.0f) * ((u8)frand())) + (5.0f));
            temp_r31->vel.z = ((0.011764707f * ((u8)frand())) + (18.0f));
        }
        particle->dataCnt = (frand() % 5) + 4;
    }
    else {
        particle->dataCnt--;
    }
    temp_r31 = particle->data;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->scale != 0) {
            temp_r31->pos.x += 1.1f;
            temp_r31->pos.z += 1.1f;
            temp_r31->scale = (temp_r31->vel.z * sind(temp_r31->vel.x)) + 1.0;
            temp_r31->vel.x += temp_r31->vel.y;
            if (temp_r31->vel.x >= 180.0f) {
                temp_r31->scale = 0.0f;
            }
        }
    }
}

void fn_2_14738(OMOBJ *object);
void fn_2_147B4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

OMOBJ *fn_2_14640(HUPROCESS *objman)
{
    OMOBJ *object;
    object = omAddObjEx(objman, 1300, 1, 0, -1, fn_2_14738);
    object->mdlId[0] = Hu3DParticleCreate(lbl_2_bss_250, 450);
    Hu3DParticleHookSet(object->mdlId[0], fn_2_147B4);
    Hu3DParticleColSet(object->mdlId[0], 255, 255, 255);
    Hu3DModelPosSet(object->mdlId[0], 0, -6000, -21000);
    Hu3DParticleAnimModeSet(object->mdlId[0], 0);
    Hu3DModelLayerSet(object->mdlId[0], 1);
    Hu3DParticleBlendModeSet(object->mdlId[0], 1);
    return object;
}

void fn_2_14738(OMOBJ *object)
{
    omSetTra(object, lbl_2_bss_6C.x, lbl_2_bss_6C.y, lbl_2_bss_6C.z);
    if (object->work[0] == 1) {
        Hu3DModelAttrSet(object->mdlId[0], HU3D_ATTR_DISPOFF);
        omDelObjEx(HuPrcCurrentGet(), object);
    }
}

void fn_2_147B4(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;
    HU3DPARTICLEDATA *temp_r31;
    s32 temp_r29;
    s32 temp_r28;
    if (particle->count == 0) {
        temp_r31 = particle->data;
        for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
            temp_r31->color.a = 180;
            temp_r31->vel.x = ((3.9215689f * ((u8)frand())) + (-500.0f));
            temp_r31->vel.y = ((3.529412f * ((u8)frand())) + (-500.0f));
            temp_r31->vel.z = (-300.0f) - ((3.9215689f * ((u8)frand())));
            temp_r31->accel.x = (360.0f / 255.0f) * ((u8)frand());
            temp_r31->accel.y = (4.0f / 255.0f) * ((u8)frand());
            temp_r31->scale = 2;
        }
        particle->dataCnt = 0;
    }
    if (particle->dataCnt == 0) {
        for (temp_r29 = 0; temp_r29 < 2; temp_r29++) {
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                if (temp_r31->color.a == 0) {
                    break;
                }
            }
            if (temp_r28 == particle->maxCnt) {
                continue;
            }
            temp_r31->color.a = 180;
            temp_r31->vel.x = -50.0f + (0.3921569f * ((u8)frand()));
            temp_r31->vel.y = 0.058823533f * ((u8)frand());
            temp_r31->accel.x = (90.0f / 255.0f) * ((u8)frand());
            temp_r31->accel.y = 5.0f + (0.098039225f * ((u8)frand()));
            temp_r31->accel.z = (float)(frand() % 10) + 8.0f;
            temp_r31->pos.z = -5.0f + ((11.0f / 255.0f) * ((u8)frand()));
            temp_r31->pos.y = (float)(frand() % 31) + -5.0f;
            temp_r31->scale = temp_r31->vel.y + 35.0f;
            temp_r31->color.a = 210;
            temp_r31->vel.y = (0.2 * temp_r31->vel.y) + 5.0;
            particle->dataCnt = (frand() % 10) + 10;
        }
    }
    else {
        particle->dataCnt--;
    }
    temp_r31 = particle->data;
    temp_f30 = lbl_2_bss_50 * 0.3f;
    for (temp_r29 = 0; temp_r29 < particle->maxCnt; temp_r29++, temp_r31++) {
        if (temp_r31->color.a == 0) {
            continue;
        }
        temp_r31->pos.x = temp_r31->vel.x;
        temp_r31->pos.y = temp_r31->vel.y;
        temp_r31->pos.z = temp_r31->vel.z;
        temp_r31->vel.x -= 0.5 * sind(temp_r31->accel.x);
        temp_r31->vel.z -= -temp_f30;
        temp_r31->accel.x += temp_r31->accel.y;
        if (temp_r31->accel.x >= 360.0f) {
            temp_r31->accel.x -= 360.0f;
        }
        if (temp_r31->vel.z >= 0.0f) {
            temp_f31 = 800.0f + ((300.0f / 255.0f) * ((u8)frand()));
            temp_r31->vel.z -= temp_f31;
        }
    }
}
